<?php

return [
    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------
    
    // pathinfo分隔符
    'pathinfo_depr'          => '/',

	// +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------

    'template'               => [
        // 模板引擎类型 支持 php think 支持扩展
        'type'         => 'think',
        // 模板路径
        'view_path'    => './template/laozhang/',
        // 模板后缀
        'view_suffix'  => 'html',
    ],

    // 视图输出字符串内容替换
    'view_replace_str' => [
        '__PUBLIC__'=>'/public/',
        '__TEMPLATE__'=>'/template/',
        '__ROOT__' => '/'
    ],

    'content_length' => 2000, // 前台文章详情页每页显示字数

    'article_count' => 15, // 前台每页显示的文章条数
    'is_page' => 1, // 首页文章是否分页展示  1：是 0：否
];